taskt/Core/Automation/Commands/FolderGroup/AFolderCopyMoveFolderCommands.dot
digraph "AFolderCopyMoveFolderCommands" {
"AFolderCopyMoveFolderCommands" -> "AFolderExistsFolderBeforeAfterResultCommands";
"AFolderExistsFolderBeforeAfterResultCommands" -> "AFolderExistsFolderPathCommands";
"AFolderExistsFolderBeforeAfterResultCommands" -> "IFolderExistsFolderPathBeforeAfterPathResultProperties";
"AFolderExistsFolderPathCommands" -> "AFolderFolderPathCommands";
"AFolderExistsFolderPathCommands" -> "IFolderExistsFolderPathProperties";
"AFolderFolderPathCommands" -> "ScriptCommand";
"AFolderFolderPathCommands" -> "IFolderPathProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
